# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development Tools
brew 'neovim'
brew 'universal-ctags'    # Fixes: Gutentags ctags job failed
brew 'node@22'            # Fixes: Copilot Node.js too old
brew 'python'
brew 'poetry'             # For your document-creation project
brew 'ruff'               # For your auto-format on save
brew 'fzf'                # For fzf-lua
brew 'ripgrep'            # For fzf-lua grep
brew 'fd'                 # For fzf-lua file finding
brew 'viu'                # For fzf-lua image previews
brew 'yarn'
brew 'direnv'
brew 'pyenv'
brew 'neovim'
brew 'python'
brew 'shellcheck'
brew 'postgresql@16'
brew 'pipx'
brew 'lazygit'

# API & Data
brew 'jq'                # Essential for processing JSON in the terminal
brew 'yq'                # Like jq, but for YAML (great for Docker Compose files)

# Terminal Enhancements
brew 'zoxide'            # A smarter 'cd' command that learns your habits
brew 'eza'               # A modern replacement for 'ls' with icons and git integration
brew 'starship'          # A fast, highly customizable shell prompt
brew 'tldr'              # Simplified man pages (try 'tldr docker')

# Python/FastAPI specific
brew 'uv'                # Extremely fast Python package installer (faster than pip/poetry)
# Apps
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'httpie' # interface to do API requests
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'
cask '1password'

# Fonts
cask 'font-source-code-pro'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
