# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
# brew 'imagemagick'
brew 'yarn'
brew 'direnv'
brew 'pyenv'
brew 'neovim'
brew 'python'
brew 'shellcheck'
brew 'postgresql@16'
brew 'pipx'
brew 'lazygit'

# Apps
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'httpie' # interface to do API requests
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'
cask '1password'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
